app/Http/Controllers/Api/CategoryController.php

    public function index()
    {
        return CategoryResource::collection(Category::has('posts')->get());
---
select * from `categories` where exists (select * from `posts` inner join `category_post` on `posts`.`id` = `category_post`.`post_id` where `categories`.`id` = `category_post`.`category_id` and `posts`.`deleted_at` is null) and `categories`.`deleted_at` is null