app/Http/Controllers/Pages/PagesController.php

    public function index()
    {
        $products = $this->product->whereStatus(true)->limit(6)->get();
        //dd(date('Y-m-d'));
        $posts = $this->post->whereStatus(true)
            ->where('published_at', '<=', date('Y-m-d H:i:s'))
            ->get();
---
select * from `products` where `status` = 1 and `products`.`deleted_at` is null limit 6
select * from `posts` where `status` = 1 and `published_at` <= '2021-10-14 14:50:49' and `posts`.`deleted_at` is null